schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
Audio       audio;
Preferences pref;
WebSrv      webSrv;
WiFiMulti   wifiMulti;
RTIME       rtc;
Ticker      ticker100ms;
IR_buttons  irb(&s_settings);
IR          ir(IR_PIN); // do not change the objectname, it must be "ir"

File           audioFile;
FtpServer      ftpSrv;
DLNA_Client    dlna;
KCX_BT_Emitter bt_emitter(BT_EMITTER_RX, BT_EMITTER_TX, BT_EMITTER_LINK, BT_EMITTER_MODE);
TwoWire        i2cBusOne = TwoWire(0); // additional HW, sensors, buttons, encoder etc
TwoWire        i2cBusTwo = TwoWire(1); // external DAC, AC101 or ES8388
hp_BH1750      BH1750(&i2cBusOne);     // create the sensor
SPIClass       spiBus(FSPI);

#if TFT_CONTROLLER < 7 // ⏹⏹⏹⏹
TFT_SPI    tft(spiBus, TFT_CS);
TP_XPT2046 tp(spiBus, TP_CS);
#else
TFT_RGB  tft;
TP_GT911 tp(&i2cBusOne);
#endif

stationManagement staMgnt(&s_cur_station);

SemaphoreHandle_t mutex_rtc;
SemaphoreHandle_t mutex_display;

/*  ╔═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
    ║                                                     D E F A U L T S E T T I N G S                                                         ║
    ╚═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format off  🟢🟡🔴
boolean defaultsettings() {

    if (!SD_MMC.exists("/ir_buttons.json")) { // if not found ir_buttons.json create a default file
        File file = SD_MMC.open("/ir_buttons.json", "w", true);
        file.write((uint8_t*)ir_buttons_json, sizeof(ir_buttons_json));
        file.close();
    }
    irb.loadButtonsFromJSON("/ir_buttons.json");
    for (uint i = 0; i < s_settings.numOfIrButtons; i++) {
        //    log_w("0x%04X,  %s", s_settings.irbuttons[i].val, s_settings.irbuttons[i].label);
        ir.set_irButtons(i, s_settings.irbuttons[i].val);
    }
    ir.set_irAddress(s_settings.irbuttons[42].val);
    //    log_w("0x%04X,  %s", s_settings.irbuttons[42].val, s_settings.irbuttons[42].label);

    if (!SD_MMC.exists("/settings.json")) { // if not found create one
        updateSettings();
    }

    File  file2 = SD_MMC.open("/settings.json", "r", false);
    char* jO = x_ps_calloc(2048, 1);
    char* tmp = x_ps_malloc(1024);
    file2.readBytes(jO, 2048);
    s_settingsHash = simpleHash(jO);
    file2.close();

    auto parseJson = [&](const char* s) { // lambda, inner function
        int16_t pos1 = 0, pos2 = 0, pos3 = 0;
        pos1 = indexOf(jO, s, 0);
        if (pos1 < 0) {
            log_e("index %s not found", s);
            return "0";
        }
        pos2 = indexOf(jO, ":", pos1) + 1;
        if (jO[pos2] == '\"')
            pos3 = indexOf(jO, "\"", pos2 + 1) + 1;
        else
            pos3 = indexOf(jO, ",", pos2);
        if (pos3 < 0) pos3 = find_first_of(jO, "}\n", pos2);
        if (jO[pos2] == '\"') {
            pos2++;
            pos3--;
        } // remove \" embraced strings
        strncpy(tmp, jO + pos2, pos3 - pos2);
        tmp[pos3 - pos2] = '\0';
        return (const char*)tmp;
    };

    auto computeMinuteOfTheDay = [&](const char* s) {
        if (!s) return 0;
        int h = atoi(s);
        int m = atoi(s + 3);
        return h * 60 + m;
    };

    s_settings.lastconnectedhost.reset();
    s_settings.lastconnectedfile.reset();

    s_volume.cur_volume = atoi(parseJson("\"volume\":"));
    s_volume.volumeSteps = atoi(parseJson("\"volumeSteps\":"));
    s_volume.ringVolume = atoi(parseJson("\"ringVolume\":"));
    s_volume.volumeAfterAlarm = atoi(parseJson("\"volumeAfterAlarm\":"));
    s_volume.BTvolume = atoi(parseJson("\"BTvolume\":"));
    s_f_BTpower = (strcmp(parseJson("\"BTpower\":"), "true") == 0) ? 1 : 0;
    s_btEmitterMode = ((strcmp(parseJson("\"BTmode\":"), "TX") == 0) ? "TX" : "RX");
    s_alarmtime[0] = computeMinuteOfTheDay(parseJson("\"alarmtime_sun\":"));
    s_alarmtime[1] = computeMinuteOfTheDay(parseJson("\"alarmtime_mon\":"));
    s_alarmtime[2] = computeMinuteOfTheDay(parseJson("\"alarmtime_tue\":"));
    s_alarmtime[3] = computeMinuteOfTheDay(parseJson("\"alarmtime_wed\":"));
    s_alarmtime[4] = computeMinuteOfTheDay(parseJson("\"alarmtime_thu\":"));
    s_alarmtime[5] = computeMinuteOfTheDay(parseJson("\"alarmtime_fri\":"));
    s_alarmtime[6] = computeMinuteOfTheDay(parseJson("\"alarmtime_sat\":"));
    s_alarmdays = atoi(parseJson("\"alarm_weekdays\":"));
    s_f_timeAnnouncement = (strcmp(parseJson("\"timeAnnouncing\":"), "true") == 0) ? 1 : 0;
    strcpy(s_timeSpeechLang, parseJson("\"timeSpeechLang\":"));
    s_f_mute = (strcmp(parseJson("\"mute\":"), "true") == 0) ? 1 : 0;
    s_brightness = atoi(parseJson("\"brightness\":"));
    s_sleeptime = atoi(parseJson("\"sleeptime\":"));
    s_cur_station = atoi(parseJson("\"station\":"));
    s_toneLP = atoi(parseJson("\"toneLP\":"));
    s_toneBP = atoi(parseJson("\"toneBP\":"));
    s_toneHP = atoi(parseJson("\"toneHP\":"));
    s_toneBAL = atoi(parseJson("\"balance\":"));
    s_timeFormat = atoi(parseJson("\"timeFormat\":"));
    s_TZName = parseJson("\"Timezone_Name\":");
    s_TZString = parseJson("\"Timezone_String\":");
    s_settings.lastconnectedhost.copy_from(parseJson("\"lastconnectedhost\":"));
    s_settings.lastconnectedfile.copy_from(parseJson("\"lastconnectedfile\":"));
    s_sleepMode = atoi(parseJson("\"sleepMode\":"));
    s_state = atoi(parseJson("\"state\":"));

    // set some items ---------------------------------------------------------------------------------------------
    if (!s_settings.lastconnectedfile.starts_with("/")) { s_settings.lastconnectedfile.assign("/audiofiles/"); } // guard
    s_SD_content.setLastConnectedFile(s_settings.lastconnectedfile.get());
    x_ps_free(&s_cur_AudioFolder);
    s_cur_AudioFolder = x_ps_strdup(s_SD_content.getLastConnectedFolder());
    x_ps_free(&s_cur_AudioFileName);
    s_cur_AudioFileName = x_ps_strdup(s_SD_content.getLastConnectedFileName());
    s_cur_AudioFileNr = s_SD_content.getPosByFileName(s_cur_AudioFileName);
    if (s_cur_AudioFileNr == -1) s_cur_AudioFileNr = 0; // not found
    // ------------------------------------------------------------------------------------------------------------
    x_ps_free(&jO);
    x_ps_free(&tmp);

    if (!SD_MMC.exists("/stations.json")) { // if not found create one
        File file1 = SD_MMC.open("/stations.json", "w", true);
        file1.write((uint8_t*)stations_json, sizeof(stations_json) - 1); // without termination
        file1.close();
    }
    staMgnt.updateStationsList();
    return true;
}
// clang-format on  🟢🟡🔴

void updateSettings() {
    if (!s_settings.lastconnectedhost.valid()) s_settings.lastconnectedhost.assign("");
    if (!s_settings.lastconnectedfile.valid()) s_settings.lastconnectedfile.assign("/audiofiles/");
    ps_ptr<char> jO;
    ; // JSON Object
    jO.assign("{\n");
    jO.appendf("  \"volume\":%i", s_volume.cur_volume);
    jO.appendf(",\n  \"volumeSteps\":%i", s_volume.volumeSteps);
    jO.appendf(",\n  \"ringVolume\":%i", s_volume.ringVolume);
    jO.appendf(",\n  \"volumeAfterAlarm\":%i", s_volume.volumeAfterAlarm);
    jO.appendf(",\n  \"BTvolume\":%i", s_volume.BTvolume);
    jO.appendf(",\n  \"BTpower\":");
    (s_f_BTpower == true) ? jO.appendf("\"true\"") : jO.appendf("\"false\"");
    jO.appendf(",\n  \"BTmode\":\"%s\"", bt_emitter.getMode());
    jO.appendf(",\n  \"alarmtime_sun\":\"%02d:%02d\"", s_alarmtime[0] / 60, s_alarmtime[0] % 60);
    jO.appendf(",\n  \"alarmtime_mon\":\"%02d:%02d\"", s_alarmtime[1] / 60, s_alarmtime[1] % 60);
    jO.appendf(",\n  \"alarmtime_tue\":\"%02d:%02d\"", s_alarmtime[2] / 60, s_alarmtime[2] % 60);
    jO.appendf(",\n  \"alarmtime_wed\":\"%02d:%02d\"", s_alarmtime[3] / 60, s_alarmtime[3] % 60);
    jO.appendf(",\n  \"alarmtime_thu\":\"%02d:%02d\"", s_alarmtime[4] / 60, s_alarmtime[4] % 60);
    jO.appendf(",\n  \"alarmtime_fri\":\"%02d:%02d\"", s_alarmtime[5] / 60, s_alarmtime[5] % 60);
    jO.appendf(",\n  \"alarmtime_sat\":\"%02d:%02d\"", s_alarmtime[6] / 60, s_alarmtime[6] % 60);
    jO.appendf(",\n  \"alarm_weekdays\":%i", s_alarmdays);
    jO.appendf(",\n  \"timeAnnouncing\":");
    (s_f_timeAnnouncement == true) ? jO.appendf("\"true\"") : jO.appendf("\"false\"");
    jO.appendf(",\n  \"timeSpeechLang\":\"%s\"", s_timeSpeechLang);
    jO.appendf(",\n  \"mute\":");
    (s_f_mute == true) ? jO.appendf("\"true\"") : jO.appendf("\"false\"");
    jO.appendf(",\n  \"brightness\":%i", s_brightness);
    jO.appendf(",\n  \"sleeptime\":%i", s_sleeptime);
    jO.appendf(",\n  \"lastconnectedhost\":\"%s\"", s_settings.lastconnectedhost.c_get());
    jO.appendf(",\n  \"lastconnectedfile\":\"%s\"", s_settings.lastconnectedfile.c_get());
    jO.appendf(",\n  \"station\":%i", s_cur_station);
    jO.appendf(",\n  \"Timezone_Name\":\"%s\"", s_TZName.c_str());
    jO.appendf(",\n  \"Timezone_String\":\"%s\"", s_TZString.c_str());
    jO.appendf(",\n  \"toneLP\":%i", s_toneLP);
    jO.appendf(",\n  \"toneBP\":%i", s_toneBP);
    jO.appendf(",\n  \"toneHP\":%i", s_toneHP);
    jO.appendf(",\n  \"balance\":%i", s_toneBAL);
    jO.appendf(",\n  \"timeFormat\":%i", s_timeFormat);
    jO.appendf(",\n  \"state\":%i", s_state);
    jO.appendf(",\n  \"sleepMode\":%i\n}", s_sleepMode);

    if (s_settingsHash != simpleHash(jO.get())) {
        File file = SD_MMC.open("/settings.json", "w", false);
        if (!file) {
            log_e("file \"settings.json\" not found");
            return;
        }
        file.print(jO.get());
        s_settingsHash = simpleHash(jO.c_get());
    }
}
/*****************************************************************************************************************************************************
 *                                                    T F T   B R I G H T N E S S                                                                    *
 *****************************************************************************************************************************************************/
void setTFTbrightness(uint8_t duty) { // duty 0...100 (min...max)
    if (TFT_BL == -1) return;
    uint8_t d = round((double)duty * 2.55); // #186
    ledcWrite(TFT_BL, d);
}

int16_t getTFTbrightness() { // duty 0...100 (min...max)
    if (TFT_BL == -1) return -1;
    return ledcRead(TFT_BL);
}

