schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
/*****************************************************************************************************************************************************
 *                                                      U R L d e c o d e                                                                            *
 *****************************************************************************************************************************************************/
// In m3u playlists, file names can be URL encoded.
// Since UTF-8 is always shorter than URI, the same memory is used for decoding
// e.g. Born%20On%20The%20B.mp3 --> Born On The B.mp3
// e.g. %D0%B8%D1%81%D0%BF%D1%8B%D1%82%D0%B0%D0%BD%D0%B8%D0%B5.mp3 --> испытание.mp3
void urldecode(char* str) {
    uint16_t p1 = 0, p2 = 0;
    char     a, b;
    while (str[p1]) {
        if ((str[p1] == '%') && ((a = str[p1 + 1]) && (b = str[p1 + 2])) && (isxdigit(a) && isxdigit(b))) {
            if (a >= 'a') a -= 'a' - 'A';
            if (a >= 'A')
                a -= ('A' - 10);
            else
                a -= '0';
            if (b >= 'a') b -= 'a' - 'A';
            if (b >= 'A')
                b -= ('A' - 10);
            else
                b -= '0';
            str[p2++] = 16 * a + b;
            p1 += 3;
        } else if (str[p1] == '+') {
            str[p2++] = ' ';
            p1++;
        } else {
            str[p2++] = str[p1++];
        }
    }
    str[p2++] = '\0';
}

/*****************************************************************************************************************************************************
 *                                                               T I M E R                                                                           *
 *****************************************************************************************************************************************************/

// clang-format off
void timer100ms(){
    static uint16_t ms100 = 0;
    s_f_100ms = true;
    ms100 ++;
    if(!(ms100 % 10))   {
        s_f_1sec  = true;
        s_time_s = rtc.gettime_s();
        if(endsWith(s_time_s, "59:53"))  s_f_timeSpeech = true;
    }
    if(!(ms100 % 100))  s_f_10sec = true;
    if(!(ms100 % 600)) {s_f_1min  = true; ms100 = 0;}
}
// clang-format on

/*****************************************************************************************************************************************************
 *                                                               D I S P L A Y                                                                       *
 *****************************************************************************************************************************************************/

inline void bgColorHeader() {
    tft.fillRect(layout.winHeader.x, layout.winHeader.y, layout.winHeader.w, layout.winHeader.h, TFT_BLACK);
}
inline void bgColorLogo() {
    tft.fillRect(layout.winLogo.x, layout.winLogo.y, layout.winLogo.w, layout.winLogo.h, TFT_BLACK);
}
inline void bgColorStationName() {
    tft.fillRect(layout.winName.x, layout.winName.y, layout.winName.w, layout.winName.h, TFT_BLACK);
}
inline void bgColorLogoAndStationname() {
    tft.fillRect(layout.winFName.x, layout.winFName.y, layout.winFName.w, layout.winFName.h, TFT_BLACK);
}
inline void bgColorTitle() {
    tft.fillRect(layout.winTitle.x, layout.winTitle.y, layout.winTitle.w, layout.winTitle.h, TFT_BLACK);
} // incl. VUmeter
inline void bgColorStreamTitle() {
    tft.fillRect(layout.winSTitle.x, layout.winSTitle.y, layout.winSTitle.w, layout.winSTitle.h, TFT_BLACK);
} // without VUmeter
inline void bgColorWithOutHeaderFooter() {
    tft.fillRect(layout.winWoHF.x, layout.winWoHF.y, layout.winWoHF.w, layout.winWoHF.h, TFT_BLACK);
}
inline void bgColorFooter() {
    tft.fillRect(layout.winFooter.x, layout.winFooter.y, layout.winFooter.w, layout.winFooter.h, TFT_BLACK);
}
inline void bgColorStaNr() {
    tft.fillRect(layout.winStaNr.x, layout.winStaNr.y, layout.winStaNr.w, layout.winStaNr.h, TFT_BLACK);
}
inline void bgColorSleep() {
    tft.fillRect(layout.winSleep.x, layout.winSleep.y, layout.winSleep.w, layout.winSleep.h, TFT_BLACK);
}
inline void bgColorDigits() {
    tft.fillRect(layout.winDigits.x, layout.winDigits.y, layout.winDigits.w, layout.winDigits.h, TFT_BLACK);
}
inline void bgColorButtonBar() {
    tft.fillRect(0, layout.winButton.y, displayConfig.dispWidth, layout.winButton.h, TFT_BLACK);
}
inline void bgColorAll() {
    tft.fillScreen(TFT_BLACK);
} // y   0...239

inline void clearHeader() {
    tft.copyFramebuffer(1, 0, layout.winHeader.x, layout.winHeader.y, layout.winHeader.w, layout.winHeader.h);
}
inline void clearLogo() {
    tft.copyFramebuffer(1, 0, layout.winLogo.x, layout.winLogo.y, layout.winLogo.w, layout.winLogo.h);
}
inline void clearStationName() {
    tft.copyFramebuffer(1, 0, layout.winName.x, layout.winName.y, layout.winName.w, layout.winName.h);
}
inline void clearLogoAndStationname() {
    tft.copyFramebuffer(1, 0, layout.winFName.x, layout.winFName.y, layout.winFName.w, layout.winFName.h);
}
inline void clearTitle() {
    tft.copyFramebuffer(1, 0, layout.winTitle.x, layout.winTitle.y, layout.winTitle.w, layout.winTitle.h);
} // incl. VUmeter
inline void clearStreamTitle() {
    tft.copyFramebuffer(1, 0, layout.winSTitle.x, layout.winSTitle.y, layout.winSTitle.w, layout.winSTitle.h);
} // without VUmeter
inline void clearWithOutHeaderFooter() {
    tft.copyFramebuffer(1, 0, layout.winWoHF.x, layout.winWoHF.y, layout.winWoHF.w, layout.winWoHF.h);
}
inline void clearFooter() {
    tft.copyFramebuffer(1, 0, layout.winFooter.x, layout.winFooter.y, layout.winFooter.w, layout.winFooter.h);
}
inline void clearStaNr() {
    tft.copyFramebuffer(1, 0, layout.winStaNr.x, layout.winStaNr.y, layout.winStaNr.w, layout.winStaNr.h);
}
inline void clearSleep() {
    tft.copyFramebuffer(1, 0, layout.winSleep.x, layout.winSleep.y, layout.winSleep.w, layout.winSleep.h);
}
inline void clearDigits() {
    tft.copyFramebuffer(1, 0, layout.winDigits.x, layout.winDigits.y, layout.winDigits.w, layout.winDigits.h);
}
inline void clearButtonBar() {
    tft.copyFramebuffer(1, 0, 0, layout.winButton.y, displayConfig.dispWidth, layout.winButton.h);
}
inline void clearAll() {
    tft.copyFramebuffer(1, 0, 0, 0, displayConfig.dispWidth, displayConfig.dispHeight);
}

// clang-format on

