schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
/*****************************************************************************************************************************************************
 *                                                                     P L A Y L I S T                                                               *
 *****************************************************************************************************************************************************/

bool preparePlaylistFromFile(const char* path) { // *.m3u
    File playlistFile = SD_MMC.open(path);
    if (!playlistFile) {
        log_e("playlistfile path not found");
        return false;
    }

    if (playlistFile.size() > 1048576) {
        log_e("Playlist too big, size > 1MB");
        playlistFile.close();
        return false;
    }
    x_ps_free(&s_playlistPath);
    vector_clear_and_shrink(s_PLS_content); // clear s_PLS_content first
    char* buff1 = x_ps_malloc(2024);
    char* buff2 = x_ps_malloc(1048);
    if (!buff1 || !buff2) {
        log_e("oom");
        playlistFile.close();
        return false;
    }
    size_t bytesRead = 0;
    bool   f_EXTINF_seen = false;

    while (playlistFile.available() > 0) {
        bytesRead = playlistFile.readBytesUntil('\n', buff1, 1024);
        if (bytesRead < 5) continue; // line is # or space or nothing, smallest filename "1.mp3" < 5
        buff1[bytesRead] = '\0';
        trim(buff1);
        if (startsWith(buff1, "#EXTM3U")) continue;
        if (startsWith(buff1, "#EXTINF:")) { // #EXTINF:8,logo-1.mp3
            strcpy(buff2, buff1 + 8);
            f_EXTINF_seen = true;
            continue;
        }
        if (startsWith(buff1, "#")) continue; // all other lines
        if (f_EXTINF_seen) {
            f_EXTINF_seen = false;
            strcat(buff1, "\n");
            strcat(buff1, buff2);
        }
        s_PLS_content.push_back(x_ps_strdup((const char*)buff1));
    }
    s_playlistPath = x_ps_strdup(playlistFile.path());
    int idx = lastIndexOf((const char*)s_playlistPath, '/');
    if (idx < 0) log_e("wrong playlist path");
    s_playlistPath[idx] = '\0';
    playlistFile.close();
    x_ps_free(&buff1);
    x_ps_free(&buff2);
    return true;
}
//____________________________________________________________________________________________________________________________________________________

bool preparePlaylistFromSDFolder(const char* path) { // all files within a SD folder
    if (!SD_MMC.exists(path)) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s not exist", path);
        return false;
    }
    File folder = SD_MMC.open(path);
    if (!folder.isDirectory()) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s is not a directory", path);
        folder.close();
        return false;
    }
    vector_clear_and_shrink(s_PLS_content); // clear _PLS_content first

    while (true) { // get content
        File file = folder.openNextFile();
        if (!file) break;
        if (file.isDirectory()) continue;
        if (isAudio(file)) { s_PLS_content.push_back(x_ps_strdup((const char*)file.path())); }
        file.close();
    }
    folder.close();

    for (int i = 0; i < s_PLS_content.size(); i++) {
        if (s_PLS_content[i][0] == 2) { // remove ASCII 2
            memcpy(s_PLS_content[i], s_PLS_content[i] + 1, strlen(s_PLS_content[i]));
        }
    }

    if (s_f_shuffle)
        sortPlayListRandom();
    else
        sortPlayListAlphabetical();

    return true;
}
//____________________________________________________________________________________________________________________________________________________
bool preparePlaylistFromDLNAFolder() {
    vector_clear_and_shrink(s_PLS_content); // clear _PLS_content first
    const std::deque<DLNA_Client::srvItem>* foldercontent = &dlna.getBrowseResult();
    for (int i = 0; i < foldercontent->size(); i++) {
        // log_i( "%d : (%d) %s %s -- %s",i, foldercontent.isAudio[i], foldercontent.itemURL[i], foldercontent.title[i], foldercontent.duration[i]);
        if (!foldercontent->at(i).isAudio) continue;
        uint16_t len =
            strlen((const char*)foldercontent->at(i).itemURL.c_get()) + strlen((const char*)foldercontent->at(i).title.c_get()) + strlen((const char*)foldercontent->at(i).duration.c_get()) + 3;
        char* itstr = x_ps_malloc(len);
        strcpy(itstr, (const char*)foldercontent->at(i).itemURL.c_get());
        strcat(itstr, "\n");
        strcat(itstr, (const char*)foldercontent->at(i).duration.c_get());
        strcat(itstr, ",");
        strcat(itstr, (const char*)foldercontent->at(i).title.c_get());
        log_i("pushing to playlist : %s", itstr);
        s_PLS_content.push_back(itstr);
    }
    if (!s_PLS_content.size()) return false;
    log_i("pls length %i", s_PLS_content.size());
    return true;
}
//____________________________________________________________________________________________________________________________________________________

void sortPlayListAlphabetical() {
    for (int i = 0; i < s_PLS_content.size(); i++) { // easy bubble sort
        for (int j = 1; j < s_PLS_content.size(); j++) {
            if (strcmp(s_PLS_content[j - 1], s_PLS_content[i]) > 0) { swap(s_PLS_content[i], s_PLS_content[j - 1]); }
        }
    }
}
//____________________________________________________________________________________________________________________________________________________

void sortPlayListRandom() {
    for (int i = 0; i < s_PLS_content.size(); i++) { // easy bubble sort
        uint16_t randIndex = random(0, s_PLS_content.size());
        swap(s_PLS_content[i], s_PLS_content[randIndex]); // swapping the values
    }
}
//____________________________________________________________________________________________________________________________________________________

void processPlaylist(boolean first) {

    char *playFile = NULL, *duration = NULL, *title = NULL, *plsContent = NULL, *plsExtension = NULL;
    bool  f_hasTitle = false, f_isURL = false, f_isRoot = false, f_isConnected = false;

    if (s_PLS_content.size() == 0) {
        log_e("playlist is empty");
        return;
    } // guard
    if (s_plsCurPos == s_PLS_content.size()) goto exit; // end of playlist
    if (first) {
        s_plsCurPos = 0;
        s_f_playlistEnabled = true;
    } // reset before start

    if (indexOf(s_PLS_content[s_plsCurPos], "\n", 0) > 0) f_hasTitle = true; // has additional infos: duration, title
    // now read from vector _PLS_content
    if (startsWith(s_PLS_content[s_plsCurPos], "http")) f_isURL = true;     // is web file
    if (startsWith(s_PLS_content[s_plsCurPos], "file://")) f_isRoot = true; // SD file from root
    if (f_hasTitle) {
        int idx = indexOf(s_PLS_content[s_plsCurPos], "\n", 0);
        plsContent = x_ps_strndup(s_PLS_content[s_plsCurPos], idx);
        plsExtension = x_ps_strdup(s_PLS_content[s_plsCurPos] + idx + 1);
    } else {
        plsContent = x_ps_strdup(s_PLS_content[s_plsCurPos]);
    }

    s_cur_Codec = 0;
    if (f_isURL) { // is web file
        playFile = x_ps_strdup(plsContent);
        connecttohost(playFile);
        f_isConnected = s_f_isWebConnected;
    } else { // is local file
        if (f_isRoot) {
            playFile = x_ps_strdup(plsContent + 7); // skip "file://"
            urldecode(playFile);
            f_isConnected = s_f_isFSConnected;
        } else { // local file, not root
            urldecode(plsContent);
            if (s_playlistPath) { // path of m3u file
                playFile = x_ps_malloc(strlen(s_playlistPath) + strlen(plsContent) + 5);
                strcpy(playFile, s_playlistPath);
                if (plsContent[0] != '/') strcat(playFile, "/");
                strcat(playFile, plsContent);
            } else { // have no playlistpath
                playFile = x_ps_malloc(strlen(plsContent) + 5);
                strcpy(playFile, plsContent);
            }
        }
        connecttoFS("SD_MMC", playFile);
        f_isConnected = s_f_isFSConnected;
    }
    if (f_isConnected) {
        SerialPrintflnCut("Playlist:    ", ANSI_ESC_YELLOW, playFile);
        webSrv.send("SD_playFile=", playFile);
        s_playerSubMenue = 1;
        changeState(PLAYER);
        if (f_hasTitle) {
            int16_t idx1 = indexOf(plsExtension, ",", 0); // "18,logo-1.mp3"
            duration = x_ps_strndup(plsExtension, idx1);
            title = x_ps_strdup(plsExtension + idx1 + 1);
            SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "Title: %s", title);
            showFileName(title);
        }
    }
    x_ps_free(&playFile);
    x_ps_free(&duration);
    x_ps_free(&title);
    x_ps_free(&plsContent);
    x_ps_free(&plsExtension);
    s_plsCurPos++;
    showPlsFileNumber();
    return;

