schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if (!get_esp_items(&s_resetReason, &s_f_FFatFound)) return;
    s_f_ESPfound = true;

    s_cur_AudioFolder = strdup("/audiofiles/");

    pref.begin("Pref", false); // instance of preferences from AccessPoint (SSID, PW ...)

#if TFT_CONTROLLER < 7
    spiBus.begin(TFT_SCK, TFT_MISO, TFT_MOSI, -1); // SPI1 for TFT
    tft.setTFTcontroller(TFT_CONTROLLER);
    tft.setDiaplayInversion(DISPLAY_INVERSION);
    tft.begin(TFT_DC); // Init TFT interface
    setTFTbrightness(100);
    tft.setFrequency(TFT_FREQUENCY);
    tft.setRotation(TFT_ROTATION);
    tft.setBackGoundColor(TFT_BLACK);

    tp.begin(TP_IRQ);
    tp.setVersion(TP_VERSION);
    tp.setRotation(TP_ROTATION);
    tp.setMirror(TP_H_MIRROR, TP_V_MIRROR);
#else
    tp.begin(TP_SDA, TP_SCL, GT911_I2C_ADDRESS, I2C_MASTER_FREQ_HZ, TP_IRQ, -1);
    tp.getProductID();
    tp.setVersion(TP_GT911::GT911);
    tp.setRotation(TP_GT911::Rotate::_0);
    tft.begin(RGB_PINS, RGB_TIMING);
    tft.setDisplayInversion(false);
    vTaskDelay(100 / portTICK_PERIOD_MS); // wait for TFT to be ready
    tft.reset();
#endif

    SerialPrintfln("setup: ...   Init SD card");
    if (IR_PIN >= 0) pinMode(IR_PIN, INPUT_PULLUP); // if ir_pin is read only, have a external resistor (~10...40KOhm)
    pinMode(SD_MMC_D0, INPUT_PULLUP);
#ifdef CONFIG_IDF_TARGET_ESP32S3
    SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
#endif
    int32_t sdmmc_frequency = SDMMC_FREQUENCY / 1000; // MHz -> KHz, default is 40MHz
    if (!SD_MMC.begin("/sdcard", true, false, sdmmc_frequency)) {
        clearAll();
        tft.setFont(displayConfig.fonts[6]);
        tft.setTextColor(TFT_YELLOW);
        tft.writeText("SD Card Mount Failed", 0, 50, displayConfig.dispWidth, displayConfig.dispHeight, TFT_ALIGN_CENTER, TFT_ALIGN_TOP, false, false);
        SerialPrintfln(ANSI_ESC_RED "SD Card Mount Failed");
        return;
    }
    float cardSize = ((float)SD_MMC.cardSize()) / (1024 * 1024);
    float freeSize = ((float)SD_MMC.cardSize() - SD_MMC.usedBytes()) / (1024 * 1024);
    SerialPrintfln(ANSI_ESC_WHITE "setup: ....  SD card found, %.1f MB by %.1f MB free", freeSize, cardSize);
    s_f_SD_MMCfound = true;
    defaultsettings();
    if (ESP.getFlashChipSize() > 80000000) { FFat.begin(); }
    if (TFT_BL >= 0) { s_f_brightnessIsChangeable = true; }
#if ESP_IDF_VERSION_MAJOR == 5
    if (TFT_BL >= 0) ledcAttach(TFT_BL, 1200, 8); // 1200 Hz PWM and 8 bit resolution
#endif

    if (TFT_CONTROLLER > 8) SerialPrintfln(ANSI_ESC_RED "The value in TFT_CONTROLLER is invalid");

    drawImage("/common/MiniWebRadioV4.jpg", 0, 0); // Welcomescreen
    updateSettings();
    if (s_brightness < 5) s_brightness = 5;
    if (s_volume.volumeSteps < 21) s_volume.volumeSteps = 21;
    setTFTbrightness(s_brightness);

    s_f_WiFiConnected = connectToWiFi();
    if (s_f_WiFiConnected) {
        strcpy(s_myIP, WiFi.localIP().toString().c_str());
        SerialPrintfln("setup: ....  connected to " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE ", IP address is " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE ", Received Signal Strength " ANSI_ESC_CYAN
                       "%i" ANSI_ESC_WHITE " dB",
                       WiFi.SSID().c_str(), s_myIP, WiFi.RSSI());

        if (!MDNS.begin("MiniWebRadio")) {
            SerialPrintfln("WiFI_info:   " ANSI_ESC_YELLOW "Error starting mDNS");
        } else
            (SerialPrintfln("WiFI_info:   mDNS started"));
        MDNS.addService("esp32", "tcp", 80);
        SerialPrintfln("WiFI_info:   mDNS name: " ANSI_ESC_CYAN "MiniWebRadio");

        ArduinoOTA.setHostname("MiniWebRadio");
        ArduinoOTA.begin();
        ftpSrv.begin(SD_MMC, FTP_USERNAME, FTP_PASSWORD); // username, password for ftp.
        setRTC(s_TZString.c_str());
    }

    placingGraphicObjects();
    sdr_BR_value.setValue(s_brightness);
    sdr_EQ_lowPass.setValue(s_toneLP);
    sdr_EQ_bandPass.setValue(s_toneBP);
    sdr_EQ_highPass.setValue(s_toneHP);
    sdr_EQ_balance.setValue(s_toneBAL);
    sdr_DL_volume.setMinMaxVal(0, s_volume.volumeSteps);
    sdr_DL_volume.setValue(s_volume.cur_volume);
    sdr_PL_volume.setMinMaxVal(0, s_volume.volumeSteps);
    sdr_PL_volume.setValue(s_volume.cur_volume);
    sdr_RA_volume.setMinMaxVal(0, s_volume.volumeSteps);
    sdr_RA_volume.setValue(s_volume.cur_volume);
    sdr_CL_volume.setMinMaxVal(0, s_volume.volumeSteps);
    sdr_CL_volume.setValue(s_volume.cur_volume);
    btn_RA_mute.setValue(s_f_mute);
    btn_CL_mute.setValue(s_f_mute);
    btn_EQ_mute.setValue(s_f_mute);
    btn_PL_mute.setValue(s_f_mute);
    btn_DL_mute.setValue(s_f_mute);
    btn_BT_power.setValue(s_f_BTpower);
    lst_DLNA.client_and_history(&dlna, &s_dlnaHistory[0]);
    lst_RADIO.currentStationNr(&s_cur_station);
    clk_AC_red.alarm_time_and_days(&s_alarmdays, s_alarmtime);

    audio.setAudioTaskCore(AUDIOTASK_CORE);
    audio.setConnectionTimeout(CONN_TIMEOUT, CONN_TIMEOUT_SSL);
    audio.setVolumeSteps(s_volume.volumeSteps);
    audio.setVolume(0);
    audio.setPinout(I2S_BCLK, I2S_LRC, I2S_DOUT, I2S_MCLK);
    audio.setI2SCommFMT_LSB(I2S_COMM_FMT);

    SerialPrintfln("setup: ....  number of saved stations: " ANSI_ESC_CYAN "%d", staMgnt.getSumStations());
    SerialPrintfln("setup: ....  number of saved favourites: " ANSI_ESC_CYAN "%d", staMgnt.getSumFavStations());
    SerialPrintfln("setup: ....  current station number: " ANSI_ESC_CYAN "%d", s_cur_station);
    SerialPrintfln("setup: ....  current volume: " ANSI_ESC_CYAN "%d", s_volume.cur_volume);
    SerialPrintfln("setup: ....  volume steps: " ANSI_ESC_CYAN "%d", s_volume.volumeSteps);
    SerialPrintfln("setup: ....  volume after alarm: " ANSI_ESC_CYAN "%d", s_volume.volumeAfterAlarm);
    SerialPrintfln("setup: ....  last connected host: " ANSI_ESC_CYAN "%s", s_settings.lastconnectedhost.c_get());
    SerialPrintfln("setup: ....  connection timeout: " ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE " ms", CONN_TIMEOUT);
    SerialPrintfln("setup: ....  connection timeout SSL: " ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE " ms", CONN_TIMEOUT_SSL);

    ir.begin(); // Init InfraredDecoder

    if (s_f_WiFiConnected) webSrv.begin(80, 81); // HTTP port, WebSocket port

    if (BT_EMITTER_CONNECT >= 0) {
        pinMode(BT_EMITTER_CONNECT, OUTPUT);
        /*digitalWrite(BT_EMITTER_CONNECT, LOW); vTaskDelay(100);*/ digitalWrite(BT_EMITTER_CONNECT, HIGH); // POWER_ON
        s_f_BTcurPowerState = true;
    }

    s_dlnaLevel = 0;
    s_dlnaHistory[0].name = strdup("Media Server");
    s_dlnaHistory[0].objId = strdup("");
    s_dlnaHistory[1].objId = strdup("0");
    s_f_dlnaSeekServer = true;

    if (s_resetReason == ESP_RST_POWERON ||   // Simply switch on the operating voltage
        s_resetReason == ESP_RST_SW ||        // ESP.restart()
        s_resetReason == ESP_RST_SDIO ||      // The boot button was pressed
        s_resetReason == ESP_RST_DEEPSLEEP) { // Wake up
        if (WiFi.isConnected()) {
            if (s_cur_station > 0)
                setStation(s_cur_station);
            else { setStationViaURL(s_settings.lastconnectedhost.c_get(), ""); }
        }
    }

    if (s_f_mute) { SerialPrintfln("setup: ....  volume is muted: (from " ANSI_ESC_CYAN "%d" ANSI_ESC_RESET ")", s_volume.cur_volume); }
    setI2STone();

    if (I2C_SCL != -1) {
        s_f_BH1750_found = BH1750.begin(BH1750.ADDR_TO_GROUND, I2C_SDA, I2C_SCL); // init the sensor with address pin connetcted to ground
    }
    if (s_f_BH1750_found) { // result (bool) wil be be "false" if no sensor found
        SerialPrintfln("setup: ....  " ANSI_ESC_WHITE "Ambient Light Sensor BH1750 found");
        BH1750.setResolutionMode(BH1750.ONE_TIME_H_RESOLUTION_MODE);
        BH1750.setSensitivity(BH1750.SENSITIVITY_ADJ_MAX);
    }
    ticker100ms.attach(0.1, timer100ms);
#if TFT_CONTROLLER == 7
    tft.clearVsyncCounter(); // clear the vsync counter and start them
#endif

    tft.fillScreen(TFT_BLACK);                                                          // Clear screen
    drawImage("/common/Wallpaper.jpg", 0, 0);                                           // Wallpaper
    tft.copyFramebuffer(0, 1, 0, 0, displayConfig.dispWidth, displayConfig.dispHeight); // copy wallpaper to background
    muteChanged(s_f_mute);
    dispFooter.setIpAddr(WiFi.localIP().toString().c_str());
    dispFooter.updateStation(s_cur_station);
    dispFooter.updateOffTime(s_sleeptime);
    dispFooter.show(true);

