schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    for (int j = 0; j < 6; j++) {
        if (j == 0) strcpy(line, pref.getString("wifiStr0").c_str());
        if (j == 1) strcpy(line, pref.getString("wifiStr1").c_str());
        if (j == 2) strcpy(line, pref.getString("wifiStr2").c_str());
        if (j == 3) strcpy(line, pref.getString("wifiStr3").c_str());
        if (j == 4) strcpy(line, pref.getString("wifiStr4").c_str());
        if (j == 5) strcpy(line, pref.getString("wifiStr5").c_str());
        if (startsWith(line, ssid) && line[strlen(ssid)] == '\t') {
            if (indexOf(line, "\t", 0) > 0) {
                int idx = indexOf(line, "\t", 0);
                strcpy(password, line + idx + 1);
                // SerialPrintfln("WiFi: .....  " ANSI_ESC_GREEN "SSID '%s', PW '%s'", ssid, password);
                return password;
            } else {
                // SerialPrintfln("WiFi: .....  " ANSI_ESC_GREEN "SSID '%s', PW '%s'", ssid, "is not set");
                return NULL;
            }
        }
    }
    return NULL;
}

bool setWiFiPW(const char* ssid, const char* password) {
    if (!ssid || !password) return NULL;
    static char* line = NULL;
    if (line) x_ps_free(&line);
    line = (char*)x_ps_malloc(512);
    if (!line) {
        log_e("oom");
        return NULL;
    }
    strcpy(line, ssid);
    strcat(line, "\t");
    strcat(line, password);

    for (int j = 1; j < 6; j++) {
        if (j == 1) strcpy(line, pref.getString("wifiStr1").c_str());
        if (j == 2) strcpy(line, pref.getString("wifiStr2").c_str());
        if (j == 3) strcpy(line, pref.getString("wifiStr3").c_str());
        if (j == 4) strcpy(line, pref.getString("wifiStr4").c_str());
        if (j == 5) strcpy(line, pref.getString("wifiStr5").c_str());
        if (startsWith(line, ssid) && line[strlen(ssid)] == '\t') {
            switch (j) {
                case 1: pref.putString("wifiStr1", line); break;
                case 2: pref.putString("wifiStr2", line); break;
                case 3: pref.putString("wifiStr3", line); break;
                case 4: pref.putString("wifiStr4", line); break;
                case 5: pref.putString("wifiStr5", line); break;
            }
            SerialPrintfln("WiFi: .....  " ANSI_ESC_GREEN "save new PW for SSID %s,  %s", ssid, line);
            return true;
        }
    }
    for (int j = 0; j < 6; j++) {
        if (j == 0) strcpy(line, pref.getString("wifiStr0").c_str());
        if (j == 1) strcpy(line, pref.getString("wifiStr1").c_str());
        if (j == 2) strcpy(line, pref.getString("wifiStr2").c_str());
        if (j == 3) strcpy(line, pref.getString("wifiStr3").c_str());
        if (j == 4) strcpy(line, pref.getString("wifiStr4").c_str());
        if (j == 5) strcpy(line, pref.getString("wifiStr5").c_str());
        if (strcmp(line, "\t") == 0) {
            switch (j) {
                case 0: pref.putString("wifiStr0", line); break;
                case 1: pref.putString("wifiStr1", line); break;
                case 2: pref.putString("wifiStr2", line); break;
                case 3: pref.putString("wifiStr3", line); break;
                case 4: pref.putString("wifiStr4", line); break;
                case 5: pref.putString("wifiStr5", line); break;
            }
            SerialPrintfln("WiFi: .....  " ANSI_ESC_GREEN "save new SSID and PW %s,  %s", ssid, line);
            return true;
        }
    }
    SerialPrintfln("WiFi: .....  " ANSI_ESC_RED "no free space for new SSID and PW %s,  %s", ssid, line);
    x_ps_free(&line);
    return false;
}

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                    L O O P                                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

void loop() {
    if (!s_f_ESPfound) {
        vTaskDelay(10);
        return;
    } // Guard:  wrong chip?
    if (!s_f_SD_MMCfound) {
        vTaskDelay(10);
        return;
    } // Guard:  SD_MMC could not be initialisized

    vTaskDelay(1);
    audio.loop();
    webSrv.loop();
    ir.loop();
    tp.loop();
    ftpSrv.handleFTP();
    ArduinoOTA.handle();
    dlna.loop();
    bt_emitter.loop();
    tft.loop();

    while (s_logBuffer.size() > 0) {
        size_t i = s_logBuffer.size();
        webSrv.send("serTerminal=", s_logBuffer[i - 1].c_get());
        s_logBuffer.pop_back();
        if (s_logBuffer.size() == 0) s_logBuffer.clear(); // Löscht alle Elemente und gibt den Speicher frei
    }

    if (s_f_dlnaBrowseServer) {
        s_f_dlnaBrowseServer = false;
        dlna.browseServer(s_currDLNAsrvNr, s_dlnaHistory[s_dlnaLevel].objId, s_totalNumberReturned);
    }
    if (s_f_clearLogo) {
        s_f_clearLogo = false;
        clearLogo();
    }
    if (s_f_clearStationName) {
        s_f_clearStationName = false;
        clearStationName();
    }

    if (s_f_playlistEnabled) {
        if (!s_f_playlistNextFile) {
            if (!audio.isRunning() && !s_f_pauseResume) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next playlist file");
                processPlaylist(false);
                s_playlistTime = millis();
                s_f_playlistNextFile = true;
            }
        } else {
            if (s_playlistTime + 5000 < millis()) s_f_playlistNextFile = false;
        }
    }
    //-----------------------------------------------------0.1 SEC------------------------------------------------------------------------------------
    if (s_f_100ms) { // calls every 0.1 second
        s_f_100ms = false;

        if (s_state == RADIO && s_radioSubMenue == 0) VUmeter_RA.update(audio.getVUlevel());

        static uint8_t factor = 0;
        static bool    f_tc = false;
        if (factor > 0) {
            factor--;
        } else {
            if (s_timeCounter.timer > 0) {
                factor = s_timeCounter.factor;
                dispFooter.updateTC(s_timeCounter.timer);
                s_timeCounter.timer--;
                f_tc = true;
            } else {
                if (f_tc) {
                    f_tc = false;
                    dispFooter.updateTC(0);
                    if (s_f_sleeping) return; // tc is active by pressing a button, but do nothing if "off"

                    if (s_state == RADIO) {
                        if (!txt_RA_staName.isEnabled()) { txt_RA_staName.show(true, false); } // assume volBox is shown
                        if (s_radioSubMenue == 1) {
                            s_radioSubMenue = 0;
                            changeState(RADIO);
                        } // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                        if (s_radioSubMenue == 2) {
                            s_radioSubMenue = 0;
                            changeState(RADIO);
                        } // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                        if (s_radioSubMenue == 3) {
                            s_radioSubMenue = 0;
                            changeState(RADIO);
                        } // show Numbers from IR
                        if (s_radioSubMenue == 4) {
                            s_radioSubMenue = 0;
                            changeState(RADIO);
                        } // IR select mode
                    } else if (s_state == STATIONSLIST) {
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                    } else if (s_state == PLAYER) {
                        if (!txt_PL_fName.isEnabled()) { txt_PL_fName.show(true, false); } // assume volBox is shown
                        if (s_playerSubMenue == 2) {
                            s_playerSubMenue = 0;
                            changeState(PLAYER);
                        }
                        if (s_playerSubMenue == 3) {
                            s_playerSubMenue = 1;
                            changeState(PLAYER);
                        }
                    } else if (s_state == AUDIOFILESLIST) {
                        s_playerSubMenue = 0;
                        changeState(PLAYER);
                    } else if (s_state == DLNA) {
                        if (!txt_DL_fName.isEnabled()) { txt_DL_fName.show(true, false); } // assume volBox is shown
                        if (s_dlnaSubMenue == 1) {
                            s_dlnaSubMenue = 0;
                            changeState(DLNA);
                        }
                    } else if (s_state == DLNAITEMSLIST) {
                        s_dlnaSubMenue = 0;
                        changeState(DLNA);
                    } else if (s_state == CLOCK) {
                        s_clockSubMenue = 0;
                        changeState(CLOCK);
                    } else if (s_state == ALARMCLOCK) {
                        s_alarmSubMenue = 0;
                        changeState(ALARMCLOCK);
                    } else if (s_state == SETTINGS) {
                        s_settingsSubMenue = 0;
                        changeState(SETTINGS);
                    } else if (s_state == BRIGHTNESS) {
                        s_brightnessSubMenue = 0;
                        changeState(BRIGHTNESS);
                    } else if (s_state == EQUALIZER) {
                        s_equalizerSubMenue = 0;
                        changeState(EQUALIZER);
                    } else {
                        ;
                    } // all other, do nothing
                }
            }
        }

