schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
        if (!s_f_rtc) { s_f_rtc = rtc.hasValidTime(); }

        int16_t audioVol = audio.getVolume();
        uint8_t currVol = s_volume.cur_volume;
        if (s_f_mute) currVol = 0;
        uint8_t steps = s_volume.volumeSteps / 7;
        if (audioVol > currVol) { // downvolume
            if (audioVol - steps >= currVol) {
                if (audioVol - steps < 0)
                    audio.setVolume(0, s_volume.volumeCurve);
                else
                    audio.setVolume(audioVol - steps, s_volume.volumeCurve);
            } else
                audio.setVolume(audioVol - 1, s_volume.volumeCurve);
        }
        if (audioVol < currVol) { // upvolume
            if (audioVol + steps <= currVol) {
                if (audioVol + steps > 255)
                    audio.setVolume(255, s_volume.volumeCurve);
                else
                    audio.setVolume(audioVol + steps, s_volume.volumeCurve);
            } else {
                audio.setVolume(audioVol + 1, s_volume.volumeCurve);
            }
        }
    }
    //-----------------------------------------------------1 SEC--------------------------------------------------------------------------------------

    if (s_f_1sec) { // calls every second
        s_f_1sec = false;
        s_totalRuntime++;
        uint16_t minuteOfTheDay = rtc.getMinuteOfTheDay();
        uint8_t  weekDay = rtc.getweekday();
        if (s_timeFormat == 24)
            clk_CL_24.updateTime(minuteOfTheDay, weekDay);
        else
            clk_CL_12.updateTime(minuteOfTheDay, weekDay);
        if (s_state == RINGING) clk_RI_24small.updateTime(minuteOfTheDay, weekDay);
        static uint8_t semaphore = 0;
        if (!semaphore) { s_f_alarm = isAlarm(weekDay, s_alarmdays, minuteOfTheDay, s_alarmtime) && s_f_rtc; } // alarm if rtc and CL green
        if (s_f_alarm) { semaphore++; }
        if (semaphore) { semaphore++; }
        if (semaphore >= 65) { semaphore = 0; }

        //------------------------------------------ALARM MANAGEMENT----------------------------------------------------------------------------------
        if (s_f_alarm) {
            s_f_alarm = false;
            changeState(RINGING);
        }
        if (s_f_eof_alarm) { // AFTER RINGING
            s_f_eof_alarm = false;
            if (!s_f_rtc) return;
            s_volume.cur_volume = s_volume.volumeAfterAlarm;
            setVolume(s_volume.cur_volume);
            audio.setVolume(s_volume.cur_volume, s_volume.volumeCurve);
            dispHeader.updateVolume(s_volume.cur_volume);
            wake_up();
        }

        if (s_f_stationsChanged) {
            s_f_stationsChanged = false;
            staMgnt.updateStationsList();
        }
        dispHeader.updateRSSI(WiFi.RSSI());
        //------------------------------------------UPDATE DISPLAY------------------------------------------------------------------------------------
        if (!s_f_sleeping || s_state == RINGING) {
            dispHeader.updateTime(s_time_s, false);
            if (s_f_newBitRate) {
                s_f_newBitRate = false;
                dispFooter.updateBitRate(s_icyBitRate);
            }
            if (s_f_newStationName) {
                s_f_newStationName = false;
                showLogoAndStationName(false);
            }
        }
        //---------------------------------------------TIME SPEECH -----------------------------------------------------------------------------------
        static bool f_resume = false;
        if (s_f_timeSpeech) { // speech the time 7 sec before a new hour is arrived
            s_f_timeSpeech = false;
            int hour = atoi(s_time_s);
            hour++;
            if (hour == 24) hour = 0; //  extract the hour
            if (s_f_mute) return;
            if (s_f_sleeping) return;
            if (s_state != RADIO) return;
            if (s_f_timeAnnouncement) {
                f_resume = true;
                s_f_eof = false;
                if (s_timeFormat == 12) {
                    if (hour > 12) hour -= 12;
                }
                sprintf(s_chbuf, "/voice_time/%s/%d_00.mp3", s_timeSpeechLang, hour);
                SerialPrintfln("Time: ...... play Audiofile %s", s_chbuf);
                connecttoFS("SD_MMC", s_chbuf);
                return;
            } else {
                SerialPrintfln("Time: ...... Announcement at %d o'clock is silent", hour);
            }
        }
        if (f_resume && s_f_eof) {
            f_resume = false;
            s_f_eof = false;
            if (s_cur_station)
                setStation(s_cur_station);
            else
                connecttohost(s_settings.lastconnectedhost.get());
            return;
        }
        //------------------------------------------AUDIO_CURRENT_TIME - DURATION---------------------------------------------------------------------
        if (audio.isRunning()) {
            s_audioFileDuration = audio.getAudioFileDuration();
            if (s_audioFileDuration > 0) {
                s_audioCurrentTime = audio.getAudioCurrentTime();
                if (s_state == PLAYER && s_audioFileDuration) {
                    pgb_PL_progress.setNewMinMaxVal(0, s_audioFileDuration);
                    pgb_PL_progress.setValue(s_audioCurrentTime);
                }
                if (s_state == DLNA && s_audioFileDuration) {
                    pgb_DL_progress.setNewMinMaxVal(0, s_audioFileDuration);
                    pgb_DL_progress.setValue(s_audioCurrentTime);
                }
                if (s_audioFileDuration) {
                    SerialPrintfcr("AUDIO_FILE:  " ANSI_ESC_GREEN "AudioCurrentTime " ANSI_ESC_GREEN "%li:%02lis, " ANSI_ESC_GREEN "AudioFileDuration " ANSI_ESC_GREEN "%li:%02lis      ",
                                   (long int)s_audioCurrentTime / 60, (long int)s_audioCurrentTime % 60, (long int)s_audioFileDuration / 60, (long int)s_audioFileDuration % 60);
                }
            }
        }
        //------------------------------------------NEW STREAMTITLE-----------------------------------------------------------------------------------
        if (s_f_newStreamTitle && !s_timeCounter.timer) {
            s_f_newStreamTitle = false;
            if (s_state == RADIO) {
                if (strlen(s_streamTitle))
                    showStreamTitle(s_streamTitle);
                else if (strlen(s_icyDescription)) {
                    showStreamTitle(s_icyDescription);
                    s_f_newIcyDescription = false;
                    webSrv.send("icy_description=", s_icyDescription);
                } else
                    txt_RA_sTitle.writeText("");
            }
            webSrv.send("streamtitle=", s_streamTitle);
        }
        //------------------------------------------NEW ICY-DESCRIPTION-------------------------------------------------------------------------------
        if (s_f_newIcyDescription && !s_timeCounter.timer) {
            if (s_state == RADIO) {
                if (!strlen(s_streamTitle)) showStreamTitle(s_icyDescription);
            }
            webSrv.send("icy_description=", s_icyDescription);
            s_f_newIcyDescription = false;
        }
        //------------------------------------------NEW COMMERCIALS-----------------------------------------------------------------------------------
        if (s_f_newCommercial && !s_timeCounter.timer) {
            if (s_state == RADIO) { showStreamTitle(s_commercial); }
            webSrv.send("streamtitle=", s_commercial);
            s_f_newCommercial = false;
        }
        //------------------------------------------END OF COMMERCIALS--------------------------------------------------------------------------------
        if (s_commercial_dur > 0) {
            s_commercial_dur--;
            if ((s_commercial_dur == 2) && (s_state == RADIO)) /* showStreamTitle(""); */
                s_f_newStreamTitle = true;                     // end of commercial? clear streamtitle
        }
        //------------------------------------------DETERMINE AUDIOCODEC------------------------------------------------------------------------------
        if (s_cur_Codec == 0) {
            uint8_t c = audio.getCodec();
            if (c != 0 && c != 8 && c < 10) { // unknown or OGG, guard: c {1 ... 7, 9}
                s_cur_Codec = c;
                SerialPrintfln("Audiocodec:  " ANSI_ESC_YELLOW "%s", codecname[c]);
                if (s_state == PLAYER) showFileLogo(PLAYER);
                if (s_state == RADIO && s_f_logoUnknown == true) {
                    s_f_logoUnknown = false;
                    showFileLogo(s_state);
                }
            }
        }
        //------------------------------------------CONNECT TO LASTHOST-------------------------------------------------------------------------------
        if (s_f_connectToLastStation) { // not used yet
            s_f_connectToLastStation = false;
            if (s_cur_station)
                setStation(s_cur_station);
            else
                connecttohost(s_settings.lastconnectedhost.get());
        }
        //------------------------------------------RECONNECT AFTER FAIL------------------------------------------------------------------------------
        if (s_f_reconnect && !s_f_WiFiConnected) {
            s_f_reconnect = false;
            connecttohost(s_settings.lastconnectedhost.get());
        }
        //------------------------------------------SEEK DLNA SERVER----------------------------------------------------------------------------------
        if (s_f_dlnaSeekServer) {
            s_f_dlnaSeekServer = false;
            dlna.seekServer();
        }
        //------------------------------------------CREATE DLNA PLAYLIST------------------------------------------------------------------------------
        if (s_f_dlnaMakePlaylistOTF && s_f_dlna_browseReady) {
            s_f_dlnaMakePlaylistOTF = false;
            s_f_dlna_browseReady = false;
            if (preparePlaylistFromDLNAFolder()) processPlaylist(true);
        }
        //------------------------------------------DLNA ITEMS RECEIVED-------------------------------------------------------------------------------
        if (s_f_dlna_browseReady) { // unused
            s_f_dlna_browseReady = false;
        }
        //-------------------------------------------WIFI DISCONNECTED?-------------------------------------------------------------------------------
        if (s_f_WiFiConnected) {
            if ((WiFi.status() != WL_CONNECTED)) {
                s_WiFi_disconnectCnt++;
                if (s_WiFi_disconnectCnt == 15) {
                    s_WiFi_disconnectCnt = 1;
                    SerialPrintfln("WiFi      :  " ANSI_ESC_YELLOW "Reconnecting to WiFi...");
                    WiFi.disconnect();
                    WiFi.reconnect();
                }
            } else {
                if (s_WiFi_disconnectCnt) {
                    s_WiFi_disconnectCnt = 0;
                    if (s_state == RADIO) audio.connecttohost(s_settings.lastconnectedhost.get());
                }
            }
        }
        //------------------------------------------CONNECTTOHOST FAIL--------------------------------------------------------------------------------
        static uint8_t failCnt = 0;
        if (s_f_webFailed) {
            failCnt++;
            if (failCnt == 30) {
                failCnt = 0;
                if (WiFi.isConnected())
                    connecttohost(s_settings.lastconnectedhost.get());
                else
                    ESP.restart();
            }
        } else
            failCnt = 0;
        //------------------------------------------GET AUDIO FILE ITEMS------------------------------------------------------------------------------
        if (s_f_isFSConnected) {
            //    uint32_t t = 0;
            //    uint32_t fs = audioGetFileSize();
            //    uint32_t br = audioGetBitRate();
            //    if(br) t = (fs * 8)/ br;
            //    log_w("Br %d, Dur %ds", br, t);
        }
        //--------------------------------------AMBIENT LIGHT SENSOR BH1750---------------------------------------------------------------------------
        if (s_f_BH1750_found) {
            int32_t ambVal = BH1750.getBrightness();
            if (ambVal < 0) goto endbrightness;
            if (ambVal > 350) ambVal = 350;
            s_bh1750Value = map_l(ambVal, 0, 350, 5, 100);
            //    log_i("s_bh1750Value %i, s_brightness %i", s_bh1750Value, s_brightness);
            if (!s_f_sleeping) {
                if (s_bh1750Value >= s_brightness)
                    setTFTbrightness(s_bh1750Value);
                else
                    setTFTbrightness(s_brightness);
            }
        endbrightness:
            BH1750.start();
        }
    } //  END s_f_1sec

