schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
                            s_f_pauseResume = audio.pauseResume();
                            if (!audio.isRunning())
                                btn_DL_pause.setOn();
                            else
                                btn_DL_pause.setOff();
                        }
                        vTaskDelay(100);
                        btn_DL_pause.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 2) { // cancel
                        btn_DL_cancel.showClickedPic();
                        vTaskDelay(100);
                        btn_DL_cancel.show();
                        stopSong();
                        txt_DL_fName.setText("");
                        txt_DL_fName.hide();
                        pgb_DL_progress.reset();
                        btn_DL_pause.setActive(false);
                        btn_DL_pause.show();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 3) { // dlna list
                        changeState(DLNAITEMSLIST);
                        txt_DL_fName.setText("");
                        return;
                    }
                    if (btnNr == 4) { // back to radio
                        btn_DL_radio.showClickedPic();
                        vTaskDelay(100);
                        setStation(s_cur_station);
                        s_playerSubMenue = 0;
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                        return;
                    }
                }
                break;
            }
            // if(s_state == DLNAITEMSLIST) {setTimeCounter(2); const char* r = lst_DLNA.getSelectedURL();
            //                              if(r){txt_DL_fName.setTextColor(TFT_CYAN); txt_DL_fName.setText(lst_DLNA.getSelectedTitle());
            //                                    s_dlnaSubMenue = 0; changeState(DLNA); connecttohost(r);}
            //                              break;
            // }
            if (s_state == CLOCK) {
                if (s_clockSubMenue == 0) {
                    s_clockSubMenue = 2;
                    btnNr = 0;
                    changeState(CLOCK);
                    setTimeCounter(2);
                    break;
                }
                if (s_clockSubMenue == 2) {
                    if (btnNr == 0) { // Alarm
                        s_alarmSubMenue = 1;
                        btnNr = 0;
                        btn_CL_alarm.showClickedPic();
                        vTaskDelay(100);
                        changeState(ALARMCLOCK);
                        return;
                    }
                    if (btnNr == 1) { // Radio
                        btn_CL_radio.showClickedPic();
                        vTaskDelay(100);
                        setStation(s_cur_station);
                        s_playerSubMenue = 0;
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                        return;
                    }
                    if (btnNr == 2) { // Mute
                        btn_CL_mute.showClickedPic();
                        muteChanged(!s_f_mute);
                        vTaskDelay(100);
                        btn_CL_mute.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 3) { // Off
                        btn_CL_off.showClickedPic();
                        vTaskDelay(100);
                        fall_asleep();
                        return;
                    }
                }
            }
            if (s_state == ALARMCLOCK) {
                if (s_alarmSubMenue == 0) {
                    s_alarmSubMenue = 1;
                    btnNr = 0;
                    changeState(ALARMCLOCK);
                    setTimeCounter(2);
                    return;
                }
                if (s_alarmSubMenue == 1) {
                    if (btnNr == 0) { // pos left
                        btn_AC_left.showClickedPic();
                        clk_AC_red.shiftLeft();
                        btn_AC_left.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 1) { // pos right
                        btn_AC_right.showClickedPic();
                        clk_AC_red.shiftRight();
                        btn_AC_right.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 2) { // pos +1
                        btn_AC_up.showClickedPic();
                        clk_AC_red.digitUp();
                        btn_AC_up.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 3) { // pos -1
                        btn_AC_down.showClickedPic();
                        clk_AC_red.digitDown();
                        btn_AC_down.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 4) { // ready
                        btn_AC_ready.showClickedPic();
                        vTaskDelay(100);
                        updateSettings();
                        s_clockSubMenue = 0;
                        changeState(CLOCK);
                        logAlarmItems();
                        return;
                    }
                }
            }
            if (s_state == SLEEPTIMER) {
                if (s_sleepTimerSubMenue == 0) {
                    s_sleepTimerSubMenue = 1;
                    btnNr = 0;
                    changeState(SLEEPTIMER);
                    setTimeCounter(2);
                    return;
                }
                if (s_sleepTimerSubMenue == 1) {
                    if (btnNr == 0) {
                        btn_SL_up.showClickedPic();
                        display_sleeptime(1);
                        btn_SL_up.showAlternativePic();
                        return;
                    }
                    if (btnNr == 1) {
                        btn_SL_down.showClickedPic();
                        display_sleeptime(-1);
                        btn_SL_down.showAlternativePic();
                        return;
                    }
                    if (btnNr == 2) {
                        btn_SL_ready.showClickedPic();
                        vTaskDelay(100);
                        dispFooter.updateOffTime(s_sleeptime);
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                        return;
                    }
                    if (btnNr == 3) {
                        btn_SL_cancel.showClickedPic();
                        vTaskDelay(100);
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                        return;
                    }
                }
            }
            if (s_state == SETTINGS) {
                if (s_settingsSubMenue == 0) {
                    s_settingsSubMenue = 1;
                    btnNr = 0;
                    changeState(SETTINGS);
                    setTimeCounter(2);
                    return;
                }
                if (s_settingsSubMenue == 1) {
                    if (btnNr == 0) {
                        btn_SE_bright.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        s_brightnessSubMenue = 1;
                        changeState(BRIGHTNESS);
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 1) {
                        btn_SE_equal.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        s_equalizerSubMenue = 1;
                        changeState(EQUALIZER);
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 2) {
                        btn_SE_wifi.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        changeState(WIFI_SETTINGS);
                        return;
                    }
                    if (btnNr == 3) {
                        btn_SE_radio.showClickedPic();
                        vTaskDelay(100);
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                        return;
                    }
                }
            }
            if (s_state == BRIGHTNESS) {
                if (s_brightnessSubMenue == 0) {
                    s_brightnessSubMenue = 1;
                    btnNr = 0;
                    changeState(BRIGHTNESS);
                    setTimeCounter(2);
                    return;
                }
                if (s_brightnessSubMenue == 1) {
                    s_radioSubMenue = 0;
                    changeState(RADIO);
                    return;
                }
            }
            if (s_state == EQUALIZER) {
                if (s_equalizerSubMenue == 0) {
                    s_equalizerSubMenue = 1;
                    btnNr = 0;
                    changeState(EQUALIZER);
                    setTimeCounter(2);
                    return;
                }
                if (s_equalizerSubMenue == 1) {
                    if (btnNr == 0) {
                        btn_EQ_Radio.showClickedPic();
                        vTaskDelay(100);
                        setStation(s_cur_station);
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                        return;
                    } // Radio
                    if (btnNr == 1) {
                        btn_EQ_Player.showClickedPic();
                        vTaskDelay(100);
                        s_playerSubMenue = 0;
                        changeState(PLAYER);
                        return;
                    } // Player
                    if (btnNr == 2) {
                        btn_EQ_mute.showClickedPic();
                        vTaskDelay(100);
                        muteChanged(!s_f_mute);
                        btn_EQ_mute.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    } // Mute
                    if (btnNr == 10) {
                        btn_EQ_balance.showClickedPic();
                        s_toneBAL = 0;
                        txt_EQ_balance.writeText("0");
                        sdr_EQ_balance.setValue(s_toneLP);
                        webSrv.send("settone=", setI2STone());
                        btn_EQ_balance.showAlternativePic();
                    }
                    if (btnNr == 20) {
                        btn_EQ_lowPass.showClickedPic();
                        s_toneLP = 0;
                        txt_EQ_lowPass.writeText("0");
                        sdr_EQ_lowPass.setValue(s_toneLP);
                        webSrv.send("settone=", setI2STone());
                        btn_EQ_lowPass.showAlternativePic();
                    }
                    if (btnNr == 30) {
                        btn_EQ_bandPass.showClickedPic();
                        s_toneBP = 0;
                        txt_EQ_bandPass.writeText("0");
                        sdr_EQ_bandPass.setValue(s_toneLP);
                        webSrv.send("settone=", setI2STone());
                        btn_EQ_bandPass.showAlternativePic();
                    }
                    if (btnNr == 40) {
                        btn_EQ_highPass.showClickedPic();
                        s_toneHP = 0;
                        txt_EQ_highPass.writeText("0");
                        sdr_EQ_highPass.setValue(s_toneLP);
                        webSrv.send("settone=", setI2STone());
                        btn_EQ_highPass.showAlternativePic();
                    }
                }
                setTimeCounter(2);
                return;
            }
            break;
        case 18:
            if (s_state == PLAYER) {
                if (s_f_isFSConnected) s_f_pauseResume = audio.pauseResume();
            }
            break;
        case 19:
            if (s_state == PLAYER) {
                if (s_f_isFSConnected) audio.stopSong();
                s_playerSubMenue = 0;
                changeState(PLAYER);
            }
            break;
        case 20:
            s_f_irOnOff = !s_f_irOnOff;
            if (s_f_irOnOff)
                fall_asleep();
            else
                wake_up();
            break;
        case 21:
            if (s_state != RADIO) {
                s_radioSubMenue = 0;
                setStation(s_cur_station);
                changeState(RADIO);
            }
            break;
        case 22:
            if (s_state != PLAYER) {
                s_playerSubMenue = 0;
                changeState(PLAYER);
            }
            break;
        case 23:
            if (s_state != DLNA) {
                s_dlnaSubMenue = 0;
                changeState(DLNA);
            }
            break;
        case 24:
            if (s_state != CLOCK) {
                s_clockSubMenue = 0;
                changeState(CLOCK);
            }
            break;
        case 25:
            if (s_state != SLEEPTIMER) {
                s_sleepTimerSubMenue = 0;
                changeState(SLEEPTIMER);
            }
            break;
        case 26: // VOLUME+
            if (s_state == RADIO) {
                txt_RA_staName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == PLAYER) {
                txt_PL_fName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == DLNA) {
                txt_DL_fName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == CLOCK) {
                upvolume();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == SLEEPTIMER) {
                upvolume();
                setTimeCounter(2);
                break;
            } // VOLUME++
            upvolume();
            break;
        case 27: // VOLUME-
            if (s_state == RADIO) {
                txt_RA_staName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == PLAYER) {
                txt_PL_fName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == DLNA) {
                txt_DL_fName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == CLOCK) {
                downvolume();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == SLEEPTIMER) {
                downvolume();
                setTimeCounter(2);
                break;
            } // VOLUME--
            downvolume();
            break;
        case 28:
            if (s_state == PLAYER) {
                if (audio.isRunning()) audio.setTimeOffset(-30);
            }
            break;
        case 29:
            if (s_state == PLAYER) {
                if (audio.isRunning()) audio.setTimeOffset(+30);
            }
            break;
        case 30: nextStation(); break;
        case 31: prevStation(); break;
        default: break;
    }
}
void ir_long_key(int8_t key) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "long pressed key nr: " ANSI_ESC_BLUE "%02i", key);
    if (key == 16) fall_asleep(); // long OK
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Event from TouchPad
// clang-format off
void tp_pressed(uint16_t x, uint16_t y) {
    //  SerialPrintfln(ANSI_ESC_YELLOW "Touchpoint  x=%d, y=%d", x, y);
    if(s_f_sleeping) return;  // awake in tp_released()
    const char* objName = NULL;
    if(s_state == RADIO && y > layout.winHeader.y + layout.winHeader.h && y < layout.sdrOvBtns.y){
        objName = "backpane";
        s_radioSubMenue++;
        if(s_radioSubMenue == 3) s_radioSubMenue = 0;
        changeState(RADIO);
        goto exit;
    }
    objName = isObjectClicked(x, y);
exit:
    if(objName){
        SerialPrintfln("click on ..  %s", objName);
    }
    return;
}
void tp_long_pressed(uint16_t x, uint16_t y){

    // if(s_f_muteIsPressed) {
    //     if(!s_f_mute){
    //         fall_asleep();
    //     }
    //     else{
    //         muteChanged(false);
    //     }
    //     return;
    // }

    if(s_state == DLNAITEMSLIST){
    //    lst_DLNA.longPressed(x, y);
    }
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void tp_released(uint16_t x, uint16_t y){

