schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    CMD_EQUALS("ping"){                 webSrv.send("pong"); return;}                                                                                     // via websocket

    CMD_EQUALS("index.html"){           SerialPrintfln("Webpage:     " ANSI_ESC_ORANGE "index.html");                                                     // via XMLHttpRequest
                                        webSrv.show(index_html, webSrv.TEXT);
                                        return;}

    CMD_EQUALS("index.js"){             SerialPrintfln("Script:      " ANSI_ESC_ORANGE "index.js");                                                       // via XMLHttpRequest
                                        webSrv.show(index_js, webSrv.JS); return;}

    CMD_EQUALS("favicon.ico"){          webSrv.streamfile(SD_MMC, "/favicon.ico"); return;}                                                               // via XMLHttpRequest

    CMD_EQUALS("test"){                 sprintf(s_chbuf, "free heap: %lu, Inbuff filled: %lu, Inbuff free: %lu, PSRAM filled %lu, PSRAM free %lu",
                                            (long unsigned)ESP.getFreeHeap(), (long unsigned)audio.inBufferFilled(), (long unsigned)audio.inBufferFree(),
                                            (long unsigned) (ESP.getPsramSize() - ESP.getFreePsram()), (long unsigned)ESP.getFreePsram());
                                        webSrv.send("test=", s_chbuf);
                                        SerialPrintfln("audiotask .. stackHighWaterMark: %lu bytes", (long unsigned)audio.getHighWatermark() * 4);
                                        SerialPrintfln("looptask ... stackHighWaterMark: %lu bytes", (long unsigned)uxTaskGetStackHighWaterMark(NULL) * 4);
                                        return;}

    CMD_EQUALS("getmute"){              if(s_f_mute) webSrv.send("mute=", "1");
                                        else        webSrv.send("mute=", "0");
                                        return;}

    CMD_EQUALS("setmute"){              muteChanged(!s_f_mute); return;}

    CMD_EQUALS("upvolume"){             webSrv.send("volume=", int2str(upvolume()));  return;}                                                            // via websocket
    CMD_EQUALS("downvolume"){           webSrv.send("volume=", int2str(downvolume())); return;}                                                           // via websocket

    CMD_EQUALS("getVolumeSteps"){       webSrv.send("volumeSteps=", int2str(s_volume.volumeSteps)); return;}

    CMD_EQUALS("setVolumeSteps"){       s_volume.cur_volume = map_l(s_volume.cur_volume, 0, s_volume.volumeSteps, 0, param.toInt());
                                        s_volume.ringVolume = map_l(s_volume.ringVolume, 0, s_volume.volumeSteps, 0, param.toInt()); webSrv.send("ringVolume=", int2str(s_volume.ringVolume));
                                        s_volume.volumeAfterAlarm = map_l(s_volume.volumeAfterAlarm, 0, s_volume.volumeSteps, 0, param.toInt()); webSrv.send("volAfterAlarm=", int2str(s_volume.volumeAfterAlarm));
                                        s_volume.volumeSteps = param.toInt(); webSrv.send("volumeSteps=", param); audio.setVolumeSteps(s_volume.volumeSteps);
                                        // log_w("s_volumeSteps  %i", s_volumeSteps);
                                        sdr_CL_volume.setMinMaxVal(0, s_volume.volumeSteps);
                                        sdr_DL_volume.setMinMaxVal(0, s_volume.volumeSteps);
                                        sdr_PL_volume.setMinMaxVal(0, s_volume.volumeSteps);
                                        sdr_RA_volume.setMinMaxVal(0, s_volume.volumeSteps);
                                        setVolume(s_volume.cur_volume);
                                        SerialPrintfln("action: ...  new volume steps: " ANSI_ESC_CYAN "%d", s_volume.volumeSteps);
                                        return;}

    CMD_EQUALS("getRingVolume"){        webSrv.send("ringVolume=", int2str(s_volume.ringVolume)); return;}
    CMD_EQUALS("setRingVolume"){        s_volume.ringVolume = param.toInt(); webSrv.send("ringVolume=", int2str(s_volume.ringVolume));
                                        SerialPrintfln("action: ...  new ring volume: " ANSI_ESC_CYAN "%d", s_volume.ringVolume); return;}

    CMD_EQUALS("getVolAfterAlarm"){     webSrv.send("volAfterAlarm=", int2str(s_volume.volumeAfterAlarm)); return;}
    CMD_EQUALS("setVolAfterAlarm"){     s_volume.volumeAfterAlarm = param.toInt(); webSrv.send("volAfterAlarm=", int2str(s_volume.volumeAfterAlarm));
                                        SerialPrintfln("action: ...  new volume after alarm: " ANSI_ESC_CYAN "%d", s_volume.volumeAfterAlarm); return;}

    CMD_EQUALS("homepage"){             webSrv.send("homepage=", s_homepage);
                                        return;}

    CMD_EQUALS("to_listen"){            StationsItems(); // via websocket, return the name and number of the current station
                                        return;}

    CMD_EQUALS("gettone"){              webSrv.send("settone=", setI2STone());
                                        return;}

    CMD_EQUALS("getstreamtitle"){       webSrv.reply(s_streamTitle, webSrv.TEXT);
                                        return;}

    CMD_EQUALS("LowPass"){              s_toneLP = param.toInt();                           // audioI2S tone
                                        char lp[30] = "Lowpass set to "; strcat(lp, param.c_str()); strcat(lp, "dB");
                                        webSrv.send("tone=", lp); setI2STone(); return;}

    CMD_EQUALS("BandPass"){             s_toneBP = param.toInt();                           // audioI2S tone
                                        char bp[30] = "Bandpass set to "; strcat(bp, param.c_str()); strcat(bp, "dB");
                                        webSrv.send("tone=", bp); setI2STone(); return;}

    CMD_EQUALS("HighPass"){             s_toneHP = param.toInt();                           // audioI2S tone
                                        char hp[30] = "Highpass set to "; strcat(hp, param.c_str()); strcat(hp, "dB");
                                        webSrv.send("tone=", hp); setI2STone(); return;}

